[
  {
    "id": 1,
    "date": "2026-02-16T04:45:00",
    "title": "Bienvenidos a ArbolApp",
    "content": "Este es mi espacio en ÁrbolApp: Red Social Libre. En este espacio puedo publicar lo que quiera, sin censura y con mis propios archivos. Las redes sociales se volvieron, lo fueron siempre pero ahora lo hacen de manera más descarada, lugares para una guerra de las élites mundiales contra los ciudadanos de a pié, para ponernos trampas, mentirnos, desinformarnos, idiotizarnos. Esta red social es un experimento, creo que cada persona, con las nuevas IA que pueden programar aplicaciones, tiene la posibilidad de crear su propia red social, aunque sea copiando el código creado por otros. Podemos seguir a las personas, blogs y medios de comunicación que queramos, sin que ninguna empresa nos lo sugiera,y no tenemos por qué pagar por ésto, ni siquiera viendo publicidad. Es necesario que llege el fin de la era de las grandes redes sociales manejadas por millonarios psicópatas y empiece el tiempo de la autoorganización de redes descentralizadas de ciudadanos comunes.",
    "media": "null",
    "type": "null"
  },
  {
    "id": 2,
    "date": "2026-02-16T08:07:00",
    "title": "Mensajería P2P",
    "content": "En este segundo post informo que actualicé la aplicación y ahora sirve también para enviar mensajes P2P, pear to pear, una forma de comunicación entre IP's que existe desde hace mucho y que probablemente se empiece a usar más en el futuro. Esta forma de cominicarse es propia de informáticos, probablemente existan aplicaciones para hacerlo pero lo desconozco, es la primera vez que la uso y, como comenté en mi cuenta de X, me sorprende mucho haber podido programar ésto. Claro que lo hice asistido por una IA, chat.z.ai, que lo programó en solo dos intentos. La nueva funcionalidad permite que una persona se comunique con el celular o computadora de otro con dos requisitos, que la aplicación esté abierta, creo que incluso la misma ventana de los mensajes P2P, todavía no estoy seguro de eso, y que uno de los dos tenga la ID del otro. Para conocer la ID solo hay que mirar en la ventana de los mensajes P2P, ahí dice cuál es la ID del dispositivo que cada uno esté usando. Una vez que alguien tiene la ID de otra persona, ya le puede enviar mensajes y la otra persona puede responderle. Entre esos mensajes conviene enviar la ID propia, así ambos ya tienen las dos ID. Esta es una forma de comunicación mucho más segura que la comunicación telefónica, con aplicaciones o por correo, no queda grabada en ningún lado, los mensajes desaparecen al cerrar la ventana. Programé ésto como parte de este experimento de red social alternativa, cualquiera puede usarlo, desdel el link: kami00dragon.github.io/ArbolApp, o se pueden descargar todos los archivos del repositorio y modificarlos como les parezca creando su propia versión de la aplicación desde github.com/kami00dragon/ArbolApp.",
    "media": "null",
    "type": "null"
  }
]
